Repository: jegqamas/Managed-UI
Catalog: ManagedUI/Properties/Resources.*.resx
Languages: ar

# CMI_Name_EditMenuItems
source: Edit &Menu
ar: تحرير ال&قائمة

# CMI_Name_EditShortcuts
source: Edit shortcuts (hotkeys)
ar: تحرير الا&ختصارات

# CMI_Name_EditToolbars
source: Edit &Toolbars
ar: تحرير &شرائط الأدوات

# CMI_Name_Exit
source: &Exit
ar: &خروج

# CMI_Name_Help
source: Show &Help
ar: عرض ال&تعليمات

# CMI_Tooltip_EditMenuItems
source: Edit menu items map, this allows to customize the menu items of the application.
ar: تحرير القائمة, هذا يخولك تحرير القائمة الأساسية للبرنامج

# CMI_Tooltip_EditShortcuts
source: Edit shortcuts and hotkeys for the menu items and the commands of the application
ar: تحرير مفاتيح الاختصارات للقوائم و الاوامر في البرنامج

# CMI_Tooltip_EditToolbars
source: Edit the toolbars, this allows to customize toolbars and buttons in the toolbars.
ar: تحرير شرائط الأدوات و الأزرار و القوائم التي فيها

# CMI_Tooltip_Exit
source: Exit the application
ar: إغلاق التطبيق

# CMI_Tooltip_Help
source: Show help about using the applciation.
ar: فتح التعليمات حول استخدام البرنامج

# DMI_Name_Language
source: &Language
ar: ال&لغة

# Label_Version
source: Version
ar: النسخة

# Message_EnteredHotkeyIsAlreadTaken
source: Entered shortcut (hotkey) is already taken by other menu item or command.
ar: المفتاح المدخل موجود سابقا و مستخدم في قائمة اخرى او امر آخر

# MIR_Name_Edit
source: &Edit
ar: &تحرير

# MIR_Name_File
source: &File
ar: &ملف

# MIR_Name_Help
source: &Help
ar: &تعليمات

# MIR_Name_Tools
source: &Tools
ar: الأ&دوات

# MIR_Name_View
source: &View
ar: ال&عرض

# Status_AllServicesClosed
source: All service(s) closed.
ar: تم اغلاق كافة الخدمات بنجاح

# Status_ClosingServices
source: Closing services ...
ar: جاري اغلاق الخدمات ...

# Status_CoreIsInitialized
source: The core is initialized successfully.
ar: تم تشغيل القاعدة بنجاح

# Status_InitializingTheCore
source: Initializing the core ...
ar: جاري تشغيل القاعدة

# Status_LanguageInterfaceFound
source: language interface found.
ar: لغة عرض تم ايجادها

# Status_LanguageInterfaceSetTo
source: Language interface set to
ar: تم تحديد لغة العرض الى

# Status_LoadingLanguageInterfeces
source: Loading language interfeces ...
ar: جاري تحميل لغات العرض

# Status_LoadingServices
source: Loading services ....
ar: جاري تحميل الخدمات

# Status_LoadingSettings
source: Loading settings ...
ar: جاري تحميل الاعدادات

# Status_LoadingTheMainWindow
source: Loading the main window ...
ar: جاري تحميل النافذة الأساسية

# Status_MainWindowLoadedSuccessfully
source: Main window loaded successfully.
ar: تم تحميل النافذة الأساسية بنجاح

# Status_NoLanguageInterfaceFound
source: No language interface found. Using default interface 'en-US'
ar: لم يتم تحديد اية لغة عرض, تم تحديد اللغة الافاتراضية 'en-US'

# Status_Ready
source: Ready !
ar: جاهز

# Status_SavingSettings
source: Saving the settings .....
ar: جاري حفظ الاعدادات

# Status_ServiceFound
source: Service found
ar: خدمة وجدت

# Status_SettingLanguageInterface
source: Setting language interface ....
ar: جاري تحديد لغة العرض

# Status_SettingsLoadedSuccessfully
source: Settings loaded successfully.
ar: تم تحميل الاعدادات بنجاح

# Status_SettingsSavedSuccessfully
source: Settings saved successfully.
ar: تم حفظ الاعدادات بنجاح

# Status_TotalOf
source: Total of
ar: إجمالي من

# FilterName_MenuItemsMapFile
source: Menu Items Map file
ar: ملف القائمة الأساسية

# FilterName_ShortcutsMapFile
source: Shortcuts Map file
ar: ملف اختصارات

# FilterName_ToolbarsMapFile
source: Toolbars Map file
ar: ملف شرائط الأدوات

# Message_MenuItemsMapSavedSuccessfully
source: Menu Items Map saved successfully.
ar: تم حفظ القائمة بنجاح

# Message_PleaseSelectAnItemFirst
source: Please select an item first !!
ar: الرجاء اختيار عنصر اولا

# Message_ShortcutsMapSavedSuccessfully
source: Shortcuts Map saved successfully.
ar: تم حفظ ملف الشرائط بنجاح

# Message_SplitterCannotHaveSubitems
source: Splitter cannot have subitems.
ar: المقسم لا يمكنه ان يحوي عناصر

# Message_ThereIsNoMenuItemToSave
source: There is no menu item to save !!
ar: لا يوجد عناصر في القائمة لحفظها

# Message_ToolbarsMapSavedSuccessfully
source: Toolbars Map saved successfully.
ar: تم حفظ ملف الشرائط بنجاح

# Message_UnableToLoadCurrentMIRFile
source: Unable to load the current menu items map file !!
ar: لم يتمكن من تحميل ملف القائمة الحالي

# Message_UnableToLoadCurrentShrtMapFile
source: Unable to load the current shortcuts map file !!
ar: لم يتمكن من تحميل ملف الاختصارات الحالي

# Message_UnableToLoadMIRFileAt
source: Unable to load the menu items map file at
ar: لم يتمكن من تحميل ملف القائمة من

# Message_UnableToLoadTheCurrentTBRFile
source: Unable to load the current toolbars map file !!
ar: لم يتمكن من تحميل ملف الشرائط

# Message_UnableToLoadTheShortcutsMapFileAt
source: Unable to load the shortcuts map file at
ar: لم يتمكن من تحميل ملف الاختصارات من

# Message_UnableToLoadTheTBRMapFileAt
source: Unable to load the toolbars map file at
ar: لم يتمكن من تحميل ملف الشرائط من

# Message_UnableToSaveTheMapFile
source: Unable to save the map file !!
ar: لم يتمكن من حفظ الملف

# Status_ApplyingMenuItemsMapToTheMainWindow
source: Applying menu items map to the main window
ar: يتم تفعيل القائمة الأساسية في النافذة الأساسية

# Status_ApplyingToolbarsMapToTheMainWindow
source: Applying toolbars map to the main window
ar: يتم تفعيل الشرائط في النافذة الاساسية

# Status_ErrorAdding
source: Error adding
ar: خطأ في إضافة

# Status_InvalidParameter
source: invalid parameter !!
ar: بارامتر غير صحيح

# Status_LanguageIdIsNotExist
source: language id is not exist
ar: معرف اللغة غير موجود او مدعوم

# Status_MIEError4
source: ERROR !! Unable to load tooltip from resources using key
ar: خطأ: فشل في تحميل نص الشرح باستخدام المفتاح

# Status_MIRError1
source: ERROR: attempting to add children to smi in the menu items map!
ar: خطأ: محاولة تحميل قائمة على مقسم في القائمة

# Status_MIRError2
source: ERROR: attempting to include root menu item in place that not root.
ar: خطأ: محاولة اضافة عنصر أساسي في عنصر ليس باساسي

# Status_MIRError3
source: Error adding element of CMI: the element of the menu map is set as CMI but the menu item representator is not a CMI !!
ar: خطأ: محاولة وضع عنصر القائمة كأمر و لكنه ليس بأمر !

# Status_NoMenuItemsMapLoadedtheGUICore
source: No menu items map loaded in the GUI Core !!
ar: لم يتم تحميل اية قائمة في قاعدة العرض

# Status_NoParamPassed
source: no parameter passed !
ar: لم يتم تمرير اية بارامتر

# Status_NoToolbarsMapLoadedInTheGUICore
source: No toolbars map loaded in the GUI Core !!
ar: لم يتم تحميل اية ملف للشرائط في القاعدة

# Status_TBRError1
source: TBR ERROR: Attembting to add DMI/RMI into a toolbar. Error in map.
ar: خطأ: محاولة وضع قائمة ديناميكة أو اساسية في شريط

# Status_UnableToExecuteCommand
source: Unable to execute the command
ar: لا يمكن تنفيذ الأمر

# Title_MIREditor
source: Menu Items Map Editor
ar: محرر القائمة الأساسية

# Title_OpenMenuItemsMapFile
source: Open Menu Items Map file
ar: قتح ملف القائمة الأساسية

# Title_OpenShortcutsMapFile
source: Open Shortcuts Map file
ar: فتح ملف الاختصارات

# Title_OpenToolbarsMapFile
source: Open Toolbars Map file
ar: فتح ملف الشرائط

# Title_SaveMenuItemsMapFile
source: Save Menu Items Map file
ar: حفظ ملف القائمة الأساسية

# Title_SaveShortcutsMapFile
source: Save Shortcuts Map file
ar: حفظ ملف الاختصارات

# Title_SaveToolbarsMapFile
source: Save Toolbars Map file
ar: حفظ الشرائط في ملف

# Title_ShortcutsMapEditor
source: Shortcuts (Hotkeys) Map Editor
ar: محرر مفاتيح الاختصارات

# Title_ToolbarsMapEditor
source: Toolbars Map Editor
ar: محرر الشرائط

# Word_Command
source: Command
ar: امر

# Word_MenuItem
source: Menu item
ar: عنصر قائمة

# Word_NewToolsbar
source: New Toolsbar
ar: شريط جديد

# Word_No
source: No
ar: لا

# Word_Yes
source: Yes
ar: نعم

# Word_Splitter
source: Splitter
ar: مقسم

# Status_AttembtingToExecuteAnEmptyShortcut
source: Attembting to execute an empty shortcut.
ar: محاولة تشغيل اختصار خالي

# Status_FileIsDamagedOrNotAShrt
source: The file is damaged or not shortcuts map file
ar: هذا الملف متضرر أو ليس بملف قائمة

# Status_fileIsNotExistAt
source: file is not exist at
ar: الملف غير موجود في

# Status_GUI1
source: Menu items map set to default !!
ar: تم استعادة القائمة الأساسية الى الافتراضية

# Status_GUI2
source: Toolbars map set to default !!
ar: تم استعادة الشرائط الى الافتراضية

# Status_GUI3
source: Shortcuts map set to default !
ar: تم استعادة الاختصارات الى الافتراضية

# Status_LoadingMenuItemsMapAt
source: Loading menu items map at
ar: جاري تحميل القائمة الأساسية من

# Status_LoadingShortcutsMapAt
source: Loading shortcuts map at
ar: جاري تحميل الاختصارات من

# Status_LoadingTBRMapFile
source: Loading toolbar representators map at
ar: جاري تحميل الشرائط من

# Status_MenuItemsMapLoadedSuccessfullyFromPath
source: Menu items map loaded successfully from path
ar: تم تحميل القائمة الأساسية من الملف بنجاح

# Status_MenuItemsMapSavedSuccessfullyAtPath
source: Menu items map saved successfully at path
ar: تم حفظ القائمة الأساسية بنجاح في الملف

# Status_SavingMenuItemsMapAtPath
source: Saving menu items map at path
ar: جاري حفظ القائمة الأساسية في

# Status_SavingShortcutsMap
source: Saving shortcuts map
ar: جاري حفظ الاختصارات

# Status_SavingTBRAt
source: Saving toolbar representators map at path
ar: جاري حفظ ملف القائمة في

# Status_ShortcutsMapFileLoadedSuccessfullyFromPath
source: Shortcuts map file loaded successfully from path
ar: تم تحميل ملف الاختصارات بنجاح من

# Status_ShortcutsMapSavedSuccessfully
source: Shortcuts map saved successfully
ar: تم حفظ ملف الاختصارات بنجاح

# Status_TBRLoadedSuccessAt
source: Toolbar representators map loaded successfully from path
ar: تم تحميل ملف الشرائط بنجاح من

# Status_TBRSavedAt
source: Toolbar representators map saved successfully at path
ar: تم حفظ ملف الشرائط بنجاح في

# Status_TheCommandCannotBeFound
source: The command cannot be found
ar: لم يتم ايجاد الأمر

# Status_TheFileIsDamagedOrNotMIR
source: The file is damaged or not menu items map file.
ar: الملف متضرر أو ليس بملف قائمة أساسي

# Status_UnableToLoadMIRMap
source: Unable to load the menu items map
ar: لم يتمكن من تحميل القائمة الأساسية

# Status_UnableToLoadTBRMapFile
source: Unable to load the toolbar representators map
ar: لم يتمكن من تحميل الشرائط

# Status_UnableToLoadTheMapFile
source: Unable to load the map file
ar: لم يتمكن من تحميل الخارطة

# Status_UnableToLoadTheShortcutsMap
source: Unable to load the shortcuts map
ar: لم يتمكن من تحميل مفاتيح الاختصارات

# Status_UnableToSaveTheMapFile
source: Unable to save the map file
ar: لم يتمكن من حفظ ملف الخارطة

# DMI_Name_Toolbars
source: &Toolbars
ar: ال&شرائط الأدوات

# Status_TBRCannotBeFound
source: toolbar is not exist
ar: الشريط غير موجود

# Word_Main
source: Main
ar: اساسي

# TMI_Name_BlankTMI
source: Blank Textbox
ar: حقل خالي

# TMI_Tooltip_BlankTMI
source: This is a blank textbox for testing purpose
ar: هذا الحق للتجريب

# CBMI_Name_Blank
source: Blank Combobox
ar: قائمة منسدلة خالية

# CBMI_Tooltip_Blank
source: Blank Combobox for testing purpose
ar: قائمة منسدلة للتجريب

# Status_MIRMapApplyed
source: Menu items map applyed successfully.
ar: تم تفعيل القائمة الأساسية بنجاح

# Status_TBRMapApplyed
source: Toolbars map applyed successfully.
ar: تم حفظ ملف الشرائط بنجاح

# Status_TCError1
source: TC ERROR! Unable to get the resource using key
ar: خطأ: لم يتمكن من الحصول على النص باستخدام المفتاح

# Status_FileIsDamagedOrNotTCC
source: The file is damaged or not tab controls map file.
ar: هذا الملف متضرر أو ليس بملف نوافذ مصغرة

# Status_LoadingTCCMap
source: Loading tab controls map
ar: جاري تحميل ملف النوافذ المصغرة

# Status_SavingTCCAt
source: Saving tab controls map at
ar: جاري حفظ خريطة النوافذ المصغرة

# Status_TCCLoadedSuccessAt
source: Tab controls loaded successfully from
ar: تم تحميل خريطة النوافذ بنجاح من

# Status_TCCSavedAt
source: Tab controls map saved successfully at
ar: تم حفظ خريطة النوافذ المصغرة بنجاح في

# Status_UnableToLoadTCCMapFile
source: Unable to load the tab controls map
ar: لم يتمكن من تحميل النوافذ المصغرة

# Status_NoTCCLoadedInCore
source: No tab controls map loaded in the core.
ar: لم يتم تحميل اية خريطة للنوافذ المصغرة في القاعدة

# DMI_Name_Tabs
source: Tabs
ar: النوافذ المصغرة

# Status_GUI4
source: Theme has been set to default !!
ar: تم استعادة السمة الى الافتراضية

# Status_LoadingTheThemeFileAt
source: Loading the theme file at
ar: جاري تحميل السمة الأساسية

# Status_SavingTHMFile
source: Saving the theme file at
ar: جاري حفظ ملف السمة

# Status_ThemeLoadedSuccessfullyFromFile
source: Theme file loaded successfully from file
ar: تم تحميل ملف السمة بنجاح من

# Status_THMError1
source: Unable to load the theme file
ar: لم يتمكن من تحميل ملف السمة

# Status_THMError2
source: The file is damaged or not a theme file.
ar: الملف متضرر او ليس بملف سمة

# Status_THMError3
source: Unable to save the theme file
ar: لم يتمكن من حفظ ملف السمة

# Status_THMSavedSuccess
source: Theme file saved successfully at file
ar: تم حفظ ملف المسة بنجاح

# CMI_Name_EditTheme
source: Edit &Theme
ar: تحرير ال&سمة

# CMI_Tooltip_EditTheme
source: Edit theme and change the way the application look like.
ar: حرر السمة و غير مظهر البرنامج

# Message_UnableToLoadCurrentTheme
source: Unable to load the current theme !
ar: لم يتمكن من تحميل ملف السمة الحالي

# FilterName_ThemeFile
source: Theme file
ar: ملف السمة

# Title_OpenThemeFile
source: Open Theme File
ar: فتح ملف السمة

# Title_SaveThemeFile
source: Save Theme To File
ar: حفظ السمة في ملف

# Title_ThemeEditor
source: Theme Editor
ar: محرر السمة

# Message_UnableToSaveTheThemeFile
source: Unable to save the theme file
ar: لم يتمكن من حفظ ملف السمة

# CMI_Name_ShowSettings
source: &Settings
ar: الا&عدادات

# CMI_Tooltip_ShowSettings
source: Edit the settings of the application.
ar: تغيير الاعدادات للبرنامج

# FilterName_SettingsBackup
source: Settings Backup
ar: نسخة احتياطية للاعدادات

# Message_ExportSettingsRequiresSaveSettings
source: Exporting settings requires to save all settings first, continue ?
ar: تصدير الاعدادات يتطلب حفظ الاعدادات الحالية, هل تريد الاكمال ؟

# Message_SettingsExportedSuccessfully
source: Settings exported successfully.
ar: تم التصدير بنجاح

# Message_SettingsImportedSuccessfully
source: Settings imported successfully.
ar: تم االاستيراد بنجاح

# Message_UnableToExportTheSettings
source: Unable to export the settings !!
ar: لم يتمكن من تصدير الاعدادات

# Message_UnableToImportTheSettings
source: Unable to import the settings !!
ar: لم يتمكن من استيراد الاعدادات

# Title_ExportSettings
source: Export Settings
ar: تصدير الاعدادات

# Title_ImportSettings
source: Import Settings
ar: استيراد الاعدادات

# TC_Name_Log
source: Log
ar: السجل

# Title_SaveLogIntoFile
source: Save log into file
ar: حفظ السجل في ملف

# Status_ExecutingCommand
source: Executing command
ar: جاري تنفيذ الأمر

# Status_ExecutingCommandLines
source: Executing command-lines
ar: جاري تنفيذ أوامر الاقلاع

# Status_ExecutingStartupCommands
source: Executing start-up commands
ar: جاري تشغيل أوامر عند البدء

# Status_ExecutingCloseupCommands
source: Executing close-up commands
ar: يتم تشغيل الأوامر عند الاغلاق

# Category_Enviroment
source: Enviroment
ar: البيئة

# SC_Description_Hotkeys
source: Allows to edit hotkeys (shortcuts) for the application.
ar: تحرير مفاتيح الاختصارات في البرنامج

# SC_Name_Hotkeys
source: Hotkeys (shortcuts)
ar: مفاتيح الاختصارات

# Message_PleaseSpecifyTheShortcutsFile
source: Please specify the shortcuts file !
ar: الرجاء اختيار الاختصار اولا

# SC_Description_MenuItems
source: Allow to edit the main menu items of the application.
ar: تحرير القائمة الأساسية في البرنامج

# SC_Name_MenuItems
source: Menu Items
ar: القائمة الأساسية

# SC_Description_Theme
source: Allows to edit the theme of the application.
ar: تحرير السمة و المظهر للبرنامج

# SC_Name_Theme
source: Theme
ar: السمة

# Message_PleaseSpecifyTheMIRFile
source: Please specify the menu items file !!
ar: الرجاء اختيار عنصر القائمة اولا

# Message_PleaseSpecifyTheThemeFile
source: Please specify the theme file !!
ar: الرجاء اختيار ملف السمة اولا

# Button_Abort
source: &Abort
ar: &خروج

# Button_Cancel
source: &Cancel
ar: إل&غاء

# Button_DontSave
source: &Don't save
ar: &عدم الحفظ

# Button_Ignore
source: &Ignore
ar: &تجاهل

# Button_NO
source: &No
ar: &لا

# Button_OK
source: &OK
ar: &موافق

# Button_Retry
source: &Retry
ar: إ&عادة المحاولة

# Button_Save
source: &Save
ar: &حفظ

# Button_Yes
source: &Yes
ar: &نعم

# Message_RestartToApply
source: Please restart the application to apply.
ar: الرجاء إعادة تشغيل البرنامج للتفعيل.

# CMI_Name_ShowConsole
source: Show Co&nsole
ar: أظهر نافذة الاوامر

# CMI_Tooltip_ShowConsole
source: Show MangedUI internal console that allows to enter commands manually.
ar: أظهر نافذة الأوامر التي تخولك ادخال الأوامر الداخلية بشكل يدوي

# CMI_Name_ShowServices
source: Show &Services
ar: إظهار كافة الخدمات

# CMI_Tooltip_ShowServices
source: Show all services that currently are running
ar: أظهر كافة الخدمات التي تعمل الان في التطبيق

# CMI_Name_LoadLayout
source: Load La&yout
ar: فتح ملف ترتيب النوافذ

# CMI_Name_SaveLayout
source: Save Layout As
ar: حفظ ترتيب النوافذ باسم

# CMI_Tooltip_LoadLayout
source: Load controls layout from a file
ar: فتح ملف ترتيب النوافذ من ملف

# CMI_Tooltip_SaveLayout
source: Save current controls layout into a file
ar: حفظ ترتيب النوافذ الحالي في ملف

# FilterName_ControlsLayout
source: Layout file
ar: ملف ترتيب النوافذ

# Title_OpenTabsControlsLayout
source: Open controls layout file
ar: فتح ملف ترتيب النوافذ

# Title_SaveTabsControlsLayout
source: Save controls layout into file
ar: حفظ ترتيب النوافذ الى ملف

# Status_ExecutingCommandCombination
source: Executing command combination
ar: يتم تنفيذ مركب اوامر

# Status_TheCommandCombinationCannotBeFound
source: The command combination cannot be found
ar: لا يمكن ايجاد مركب الاوامر

# Status_ServiceIsBlacklistedAndRemoved
source: This service is blacklisted and successfully removed (not initialized).
ar: هذه الخدمة مسجلة في لائحة الخدمات الغير مصرح بها. تم تجاهل هذه الخدمة و لم يتم تحميلها.

# Status_AlreadyBlacklisted
source: already blacklisted.
ar: مدرجة سابقا في لائحة الخدمات المعطلة

# Status_CannotBeBlacklistedDefaultService
source: cannot be disabled because of this service is marked as a DEFAULT service.
ar: لا يمكن تعطيلها لانها معرفة على انها خدمة افتراضية

# Status_DoesntExistCannotBeDisabled
source: does not exist, thus it cannot be disabled.
ar: خدمة غير موجودة لذلك لا يمكن تعطيلها.

# Status_HasBeenBlacklisted
source: has been blacklisted (disabled) successfully.
ar: تم ادراجها في لائحة الخدمات المعطلة

# Word_ServiceWithID
source: Service with id
ar: خدمة مع المعرف

# Status_IEServiceRemoved
source: i.e. service removed
ar: بمعنى اخر: الخدمة محذوفة

# Status_NoServiceIsListedAsBlacklisted
source: No service is listed as blacklisted.
ar: لا يوجد خدمات معطلة

# Status_ServiceIDInBlackListCannotBeFound
source: ERROR: this service id is in blacklist but the service cannot be found
ar: خطأ: هذه الخدمة مدرجة على لائحة الخدمات المعطلة لكنها ليست محملة و او غير موجودة.

# Status_AlreadyEnabled
source: already enabled.
ar: مفعلة مسبقا

# Status_CannotBeEnabledServiceDoesntExist
source: cannot be enabled, the service does not exist.
ar: لا يمكن حذف الخدمة من قائمة الخدمات المعطلة (تفعيل الخدمة), الخدمة غير موجودة

# Status_CannotBeEnabledTheServiceIsDefault
source: cannot be enabled, the service is marked as a DEFAULT service (default services cannot be disabled, did you hack blacklist ?).
ar: لا يمكن حذف الخدمة من قائمة الخدمات المعطلة (تفعيل الخدمة), الخدمة هي خدمة افتراضية

# Status_HasBeenRemovedFromBlacklist
source: has been removed from blacklist (enabled) successfully.
ar: تم حذف الخدمة من قائمة الخدمات المعطلة (تم تفعيل الخدمة)

# Status_NoServiceInBlacklist
source: No service is blacklisted !!
ar: لا يوجد اي خدمة معطلة

# Word_CancelIn
source: Cancel in
ar: إلغاء في

# Word_PressKeysFor
source: Press key(s) for
ar: الرجاء الضغط على ازرار الاختصار

# Word_Seconds
source: second(s)
ar: ثانية

# Status_ShortcutsEnabledForThisTabControl
source: Shortcuts enabled for this tab control !
ar: الاختصارات مفعلة لهذا التحكم

# Status_ShortcutsSuppressedForThisTabControl
source: Shortcuts suppressed for this tab control !
ar: الاختصارات موقفة لهذا التحكم

# Word_FileForDetails
source: file for details
ar: للمزيد من التفاصيل

# Word_PleaseSee
source: Please see
ar: الرجاء النظر في

# Status_ApplicationFoldersCheckedSuccessfully
source: Application folders checked successfully.
ar: تم تفحص مجلدات البرنامج الضرورية بنجاح

# Status_CheckingApplicationFolders
source: Checking application folders ...
ar: جاري تفحص مجلدات البرنامج الضرورية

# Error_CoreCannotInitialize
source: Core cannot initialize.
ar: لايمكن تشغيل المكتبة الاساسية

# Error_NotValidRequiredServicesList
source: The required service list is not valid in parameters, application cannot be initialized.
ar: قائمة الخدمات المطلوبة غير صالحة. لا يمكن تشغيل البرنامج.

# Error_NotValidRequiredServicesListAtLeastOneService
source: The required service list is empty, at least one service must be listed in order of the application to work. Application cannot be initialized.
ar: قائمة الخدمات المطلوبة غير صالحة. على الاقل خدمة واحدة يجب ان تكون مدرجة في القائمة. لا يمكن تشغيل البرنامج.

# Error_NotValidRequiredServicesListAtMissingService
source: There is a missing required service in the application. Application cannot be initialized.
ar: قائمة الخدمات المطلوبة غير صالحة. هناك خدمة مهمة مفقودة. لا يمكن تشغيل البرنامج.

# MessageCaption_CoreInitialize
source: Core Initialize
ar: تشغيل المكتبة الاساسية

# Word_MissingServiceID
source: Missing service id
ar: معرف الخدمة المفقودة

# DMI_Name_Layouts
source: &Layouts
ar: وا&جهات

# DMI_Name_Themes
source: &Themes
ar: &سمات

# CMI_Name_LoadTheme
source: Load Theme
ar: فتح سمة

# DMI_Name_Shortcuts
source: S&hortcut Maps
ar: خرائط اختصارات
